
print(__name__)
# ================================

def foo():
    print("hello...")
if __name__=="__main__":
    foo()



# در پایتون امکان این وجود دارد که بتوانیم یه function رو جوری برنامه ریزی کنیم که فقط در صورتی که به صورت مستقیم صدا زده شد اجرا شود.

# زمانی که شما یک کد پایتونی رو اجرا میکنید، پایتون میاد چندتا special variable رو ایجاد میکنه و یه سری اطلاعات رو داخل اونها ذخیره میکنه. یکی از این متغیرهای خاص __name__ هستش.

# به طور کلی __name__ دو تا مقدار میگیره:

# 1. اگه شما یک ماژول رو به صورت مستقیم run کنید مقدار __main__ رو میگیره.

# 2. و اگه جای دیگه import کرده باشیدش اسم اون ماژول رو میگیره.

